"""
Cервис товаров в списке сравнения.
Позволяет:
 - добавить товар в список сравнения;
 - убрать товар из этого списка;
 - получать список товаров, добавленных к сравнению;
 - получать количество товаров в этом списке.
"""


class ProductCompare:
    """Класс товаров в списке сравнения."""

    def add_product_to_compare(self):
        """Добавить товар в список сравнения"""
        pass

    def del_product_from_compare(self):
        """Удалить товар из список сравнения"""
        pass

    def list_product_compare(self):
        """Список товаров в списке сравнения"""
        pass

    def count_product_compare(self):
        """Количество товаров в списке сравнения"""
        pass
